tuanpm2205/Driver_STM32/NRF24L01P/nrf.h
#ifndef NRF_H_
#define NRF_H_

#include "stm32f1xx_hal.h"
#include <stdint.h>

/*------------------------------------*/

//---------Config NRF for use---------//
#define NRF_CE_GPIO GPIOA
#define NRF_CS_GPIO GPIOA

#define NRF_CE_PIN GPIO_PIN_1
#define NRF_CS_PIN GPIO_PIN_2

extern SPI_HandleTypeDef hspi2;
#define NRF_SPI &hspi2
//------------End config--------------//

/*------------------------------------*/

//-----Define register & command------//
#define CONFIG      				0x00
#define EN_AA       				0x01
#define EN_RXADDR   				0x02
#define SETUP_AW    				0x03
#define SETUP_RETR					0x04
#define RF_CH       				0x05
#define RF_SETUP    				0x06
#define STATUS      				0x07
#define OBSERVE_TX  				0x08
#define RPD          				0x09
#define RX_ADDR_P0  				0x0A
#define RX_ADDR_P1  				0x0B
#define RX_ADDR_P2  				0x0C
#define RX_ADDR_P3  				0x0D
#define RX_ADDR_P4  				0x0E
#define RX_ADDR_P5  				0x0F
#define TX_ADDR     				0x10
#define RX_PW_P0    				0x11
#define RX_PW_P1    				0x12
#define RX_PW_P2    				0x13
#define RX_PW_P3    				0x14
#define RX_PW_P4    				0x15
#define RX_PW_P5    				0x16
#define FIFO_STATUS 				0x17
#define DYNPD	    					0x1C
#define FEATURE	    				0x1D

//Following the datasheet NRF24L01+ rev1.0
#define R_REGISTER    			0x00
#define W_REGISTER    			0x20
#define R_RX_PAYLOAD  			0x61
#define W_TX_PAYLOAD  			0xA0
#define FLUSH_TX      			0xE1
#define FLUSH_RX      			0xE2
#define REUSE_TX_PL   			0xE3
#define R_RX_PL_WID   			0x60
#define W_ACK_PAYLOAD 			0xA8
#define W_TX_PAYLOAD_NOACK 	0xB0
#define NOP           			0xFF
//------------End define--------------//

/*------------------------------------*/

//-------------Function---------------//
void 				CS_Low						(void); // Select
void 				CS_High						(void); // Unselect

void 				CE_Low						(void); // Disable
void 				CE_High						(void); // Enable

void 				NRF_W_Reg					(uint8_t Reg, uint8_t Data);
void				NRF_Wx_Reg				(uint8_t Reg, uint8_t *Data, uint8_t Size);

uint8_t 		NRF_R_Reg					(uint8_t Reg);
void				NRF_Rx_Reg				(uint8_t Reg, uint8_t *Data, uint8_t Size);

void				NRF_Send_CMD			(uint8_t Cmd);

void				NRF_Init					(void);
void				NRF_Reset					(uint8_t Register);

void				NRF_PTX_Begin			(uint8_t *Address, uint8_t Channel);
uint8_t			NRF_Transmit			(uint8_t *Data);

void				NRF_PRX_Begin			(uint8_t *Address, uint8_t Channel);
void				NRF_Receive				(uint8_t *Data);
uint8_t			NRF_isData				(uint8_t Pipe);
//-----------End function-------------//

#endif